Repository: SaifZnaidi/SchoolManagement3SR2425
Catalog: Translations/SchoolManagement3SR2.*.xlf
Languages: fr

# Table 3454070650 - Property 2879900210
source: Class
fr: Classe

# Table 3454070650 - Field 1159662906 - Property 2879900210
source: Student's Number
fr: Nombre des étudiants

# Table 3454070650 - Field 2199584568 - Property 2879900210
source: Teacher
fr: Enseigant

# Table 222620933 - Field 3320823955 - Property 2879900210
source: Line No.
fr: N° ligne

# Table 222620933 - Field 1862981322 - Property 2879900210
source: Semester
fr: Semestre

# Table 222620933 - Field 1234124704 - Property 2879900210
source: Subject
fr: Matière

# Table 222620933 - Field 1234124704 - Method 2126772001 - NamedType 3775775102
source: You have already affected the note %1 to %2
fr: Vous avez déjà affecter la note %1 pour %2

# Table 222620933 - Field 3757450838 - Property 2879900210
source: Subject Description
fr: Description matière

# Table 1418429579 - Property 2879900210
source: Student
fr: Etudiant

# Table 1418429579 - Field 3086873342 - Property 2879900210
source: AVG S1
fr: Moyenne semestre 1

# Table 1418429579 - Field 1173783491 - Property 2879900210
source: AVG S2
fr: Moyenne semestre 2

# Table 1418429579 - Field 1576740555 - Property 2879900210
source: Birth Date
fr: [NAB: NOT TRANSLATED]

# Table 1418429579 - Field 2016694080 - Method 2126772001 - NamedType 2427450428
source: The CIN should be 8 caracters
fr: Le CIN doit être composer de 8 caractères.

# Table 1418429579 - Field 3454070650 - Property 2879900210
source: Class
fr: Classe

# Table 1418429579 - Field 503055404 - Property 2879900210
source: Class Description
fr: Description class

# Table 1418429579 - Field 3444679095 - Property 2879900210
source: First Name
fr: Prénom

# Table 1418429579 - Field 4068742839 - Property 2879900210
source: Last Name
fr: Nom

# Table 1418429579 - Field 4263036364 - Property 2879900210
source: Overall Year AVG
fr: Moyenne générale

# Table 466567457 - Property 2879900210
source: Subjects
fr: Matière

# Table 466567457 - Field 3657287603 - Property 2879900210
source: Coeff
fr: Coéff

# Codeunit 219391563 - Method 1145841195 - NamedType 408318675
source: First Semester AVG is inserted with sucess.
fr: La moyenne de la semestre 1 est insérée avec succès.

# Codeunit 219391563 - Method 1145841195 - NamedType 3775775102
source: Something went Wrong.
fr: Une erreur s'est produit.

# Page 3454070650 - Property 2879900210
source: Class Card
fr: Fiche classe

# Page 4190511620 - Property 2879900210
source: Class List
fr: Liste classe

# Page 1418429579 - Property 2879900210
source: Student Card
fr: Fiche étudiant

# Page 1418429579 - NamedType 575065944
source: Click here to calculate the first semester average and insert it into the table student.
fr: Cliquez ici pour calculer la moyenne de ma première semestre et l'inserer dans la fiche étudiant.

# Page 1418429579 - Control 1716203636 - Property 2879900210
source: Averages
fr: Moyennes

# Page 1418429579 - Control 2796525916 - Property 2879900210
source: Class
fr: Classe

# Page 1418429579 - Control 2445482498 - Property 2879900210
source: General
fr: Général

# Page 1418429579 - Action 3038470649 - Property 2879900210
source: Calculate first semester average
fr: Calculer moyenne semestre 1

# Page 244912790 - Property 2879900210
source: Student List
fr: Liste étudiant

# Page 244912790 - Action 1276828917 - Property 2879900210
source: Student List
fr: Liste étudiant

# Page 1078183860 - Property 2879900210
source: Subject Card
fr: Fiche matière

# Page 3415120402 - Property 2879900210
source: Subject List
fr: Liste matière

# Page 2656041305 - Property 2879900210
source: Teachers
fr: Enseignants

# Report 1686251231 - Property 2879900210
source: Class Student List
fr: Liste classe étudiant

# Report 1824029429 - Property 2879900210
source: Student List
fr: Liste étudiant

# Report 1824029429 - Control 2088295013 - Property 2879900210
source: Class
fr: Classe

# TableExtension 1028528413 - Field 2818324089 - Property 2879900210
source: Job
fr: Fonction
